{
    "EVENT": [
        {
            "name": "Bilbo's Unexpected Party",
            "type": "ceremony",
            "summary": "Bilbo Baggins throws a grand eleventy-first birthday party, surprising his guests by vanishing with the use of the One Ring and leaving Bag End to Frodo.",
            "_key": "EVEN_01"
        },
        {
            "name": "Gandalf's Warning",
            "type": "conversation",
            "summary": "Gandalf reveals the true nature of the ring to Frodo, explaining its history and the danger it poses. He advises Frodo to leave the Shire.",
            "_key": "EVEN_02"
        },
        {
            "name": "Departure from Hobbiton",
            "type": "journey",
            "summary": "Frodo, Sam, and Pippin leave Bag End secretly, beginning their journey east.",
            "_key": "EVEN_03"
        },
        {
            "name": "Encounter with a Black Rider",
            "type": "encounter",
            "summary": "The hobbits encounter a Black Rider on the road, raising their suspicions and fear.",
            "_key": "EVEN_04"
        },
        {
            "name": "Meeting with Gildor",
            "type": "encounter",
            "summary": "The hobbits meet Gildor Inglorion and other Elves, who offer them shelter and warn them of the Black Riders.",
            "_key": "EVEN_05"
        },
        {
            "name": "Trapped by Old Man Willow",
            "type": "encounter",
            "summary": "The hobbits are caught by Old Man Willow, a malevolent tree, but are rescued by Tom Bombadil.",
            "_key": "EVEN_06"
        },
        {
            "name": "Stay at Tom Bombadil's House",
            "type": "encounter",
            "summary": "The hobbits stay at the house of Tom Bombadil and Goldberry, where they learn more about the Old Forest and the Barrow-downs. Tom gives them advice and teaches them a rhyme for protection.",
            "_key": "EVEN_07"
        },
        {
            "name": "Encounter with Barrow-wights",
            "type": "supernatural",
            "summary": "The hobbits are captured by Barrow-wights, but Frodo remembers Tom's rhyme and calls for help, leading to their rescue.",
            "_key": "EVEN_08"
        },
        {
            "name": "Arrival in Bree",
            "type": "journey",
            "summary": "The hobbits arrive at the village of Bree and stay at the Prancing Pony inn.",
            "_key": "EVEN_09"
        },
        {
            "name": "Meeting with Strider",
            "type": "encounter",
            "summary": "The hobbits meet Strider (Aragorn), who warns them of danger and offers to guide them.",
            "_key": "EVEN_10"
        },
        {
            "name": "Frodo's Disappearance",
            "type": "supernatural",
            "summary": "Frodo accidentally puts on the Ring and vanishes in the common-room of the inn, arousing suspicion.",
            "_key": "EVEN_11"
        },
        {
            "name": "Attack at Crickhollow",
            "type": "attack",
            "summary": "Black Riders attack Crickhollow, but Fatty Bolger escapes and raises the alarm.",
            "_key": "EVEN_12"
        },
        {
            "name": "Escape from Bree",
            "type": "journey",
            "summary": "The hobbits and Strider escape from Bree after their ponies are stolen.",
            "_key": "EVEN_13"
        },
        {
            "name": "Pursuit and Rescue",
            "type": "chase",
            "summary": "The hobbits are pursued by Black Riders, but are rescued by Glorfindel and brought to Rivendell.",
            "_key": "EVEN_14"
        },
        {
            "name": "Council of Elrond",
            "type": "meeting",
            "summary": "The Council of Elrond discusses the history of the Ring and decides that it must be destroyed in the fires of Mount Doom. The Fellowship of the Ring is formed.",
            "_key": "EVEN_15"
        },
        {
            "name": "Journey through Hollin",
            "type": "journey",
            "summary": "The Fellowship journeys south from Rivendell, passing through the country of Hollin.",
            "_key": "EVEN_16"
        },
        {
            "name": "The Redhorn Gate",
            "type": "challenge",
            "summary": "The Fellowship attempts to cross the Misty Mountains through the Redhorn Gate, but is forced back by a blizzard.",
            "_key": "EVEN_17"
        },
        {
            "name": "Entering Moria",
            "type": "journey",
            "summary": "The Fellowship enters the Mines of Moria, hoping to find a way through the mountains.",
            "_key": "EVEN_18"
        },
        {
            "name": "Balin's Tomb",
            "type": "discovery",
            "summary": "The Fellowship discovers the tomb of Balin and the Book of Mazarbul, learning of the fate of the dwarves who tried to reclaim Moria.",
            "_key": "EVEN_19"
        },
        {
            "name": "The Bridge of Khazad-dûm",
            "type": "battle",
            "summary": "The Fellowship is attacked by Orcs and a Balrog. Gandalf confronts the Balrog on the bridge and falls into the abyss.",
            "_key": "EVEN_20"
        },
        {
            "name": "Arrival in Lothlórien",
            "type": "journey",
            "summary": "The Fellowship escapes from Moria and finds refuge in the Elven realm of Lothlórien.",
            "_key": "EVEN_21"
        },
        {
            "name": "Gifts of Galadriel",
            "type": "encounter",
            "summary": "The Fellowship meets Galadriel, who shows them visions in her Mirror and gives them gifts to aid them on their journey.",
            "_key": "EVEN_22"
        },
        {
            "name": "Farewell to Lórien",
            "type": "ceremony",
            "summary": "The Fellowship bids farewell to Lothlórien and sets out on the Great River Anduin in boats.",
            "_key": "EVEN_23"
        },
        {
            "name": "The Argonath",
            "type": "encounter",
            "summary": "The Fellowship passes the Argonath, the Pillars of the Kings, a monument to the ancient kings of Gondor.",
            "_key": "EVEN_24"
        },
        {
            "name": "The Breaking of the Fellowship",
            "type": "crisis",
            "summary": "Boromir attempts to take the Ring from Frodo. Frodo puts on the Ring and escapes. The Fellowship is scattered.",
            "_key": "EVEN_25"
        }
    ],
    "ORGANIZATION": [
        {
            "name": "White Council",
            "type": "Council",
            "description": "A council of Wise, including Gandalf and Saruman, that opposed the Dark Lord.",
            "significance": "Drove the evil power from Mirkwood, but it later returned to Mordor.",
            "_key": "ORGA_01"
        },
        {
            "name": "House of Finrod",
            "type": "Elven House",
            "description": "An Elven house or kindred, to which Gildor Inglorion belongs.",
            "significance": "Offered Frodo and his companions shelter and guidance in the Woody End.",
            "_key": "ORGA_02"
        },
        {
            "name": "Wandering Companies",
            "type": "Elven groups",
            "description": "Groups of Elves who wander and keep watch.",
            "significance": "Were informed of Frodo's journey by Gildor.",
            "_key": "ORGA_03"
        },
        {
            "name": "House of Butterbur",
            "type": "Family",
            "description": "The family that kept the Prancing Pony inn in Bree for generations.",
            "significance": "Provided lodging and information to the hobbits.",
            "_key": "ORGA_04"
        },
        {
            "name": "Dúnedain",
            "type": "Race of Men",
            "description": "The descendants of the Númenóreans, also known as Men of the West. Aragorn is their chief.",
            "significance": "Played a crucial role in the fight against the Dark Lord, including guarding the Shire and aiding Frodo's quest.",
            "_key": "ORGA_05"
        },
        {
            "name": "Rangers",
            "type": "Group",
            "description": "Wanderers of the North, skilled in tracking and woodcraft. Aragorn is one of them.",
            "significance": "Helped Gandalf track Gollum and protected the hobbits.",
            "_key": "ORGA_06"
        },
        {
            "name": "Ace Books",
            "type": "Publishing Company",
            "description": "An American paperback firm.",
            "significance": "Published an unauthorized edition of The Lord of the Rings.",
            "_key": "ORGA_07"
        },
        {
            "name": "Ballantine Books",
            "type": "Publishing Company",
            "description": "An American publishing company.",
            "significance": "Published an authorized paperback edition of The Lord of the Rings.",
            "_key": "ORGA_08"
        },
        {
            "name": "George Allen & Unwin",
            "type": "Publishing Company",
            "description": "A British publishing company.",
            "significance": "The original publisher of The Lord of the Rings in Great Britain.",
            "_key": "ORGA_09"
        },
        {
            "name": "Houghton Mifflin Company",
            "type": "Publishing Company",
            "description": "An American publishing company.",
            "significance": "Published The Lord of the Rings in the United States.",
            "_key": "ORGA_10"
        },
        {
            "name": "HarperCollins",
            "type": "Publishing Company",
            "description": "A British publishing company.",
            "significance": "Later publisher of The Lord of the Rings.",
            "_key": "ORGA_11"
        },
        {
            "name": "Galadhrim",
            "type": "Elven people",
            "description": "The Elves of Lothlórien, also known as the Tree-people.",
            "significance": "Provided the Company with shelter, gifts, and guidance.",
            "_key": "ORGA_12"
        }
    ],
    "CHAPTER": [
        {
            "title": "A LONG-EXPECTED PARTY",
            "position": 1,
            "summary": "Bilbo Baggins, a wealthy and eccentric hobbit, throws a lavish eleventy-first birthday party.  He makes a surprising announcement during his speech: he is leaving the Shire and Bag End. Using his magic ring, he disappears in a flash of light, leaving his bewildered guests and his heir, Frodo, behind. Gandalf discusses the ring with Frodo, revealing its dangerous nature and advising him to keep it secret and safe.",
            "_key": "CHAP_01"
        },
        {
            "title": "THE SHADOW OF THE PAST",
            "position": 2,
            "summary": "Gandalf reveals to Frodo the true nature of the ring: it is the One Ring, the master ring forged by Sauron, the Dark Lord. He explains the ring's history, how it was lost, and how it came into Bilbo's possession. Gandalf also tells Frodo about Gollum, the ring's previous owner, and how he was captured and interrogated. The chapter ends with Gandalf urging Frodo to leave the Shire, as the ring will soon attract the attention of Sauron and his servants.",
            "_key": "CHAP_02"
        },
        {
            "title": "THREE IS COMPANY",
            "position": 3,
            "summary": "Frodo prepares to leave the Shire, selling Bag End and making arrangements to move to Crickhollow. Gandalf departs on a mission to gather information. Merry Brandybuck reveals that he and Pippin have known about the ring and Frodo's plans for some time, and they insist on joining him on his journey. Sam Gamgee, having overheard Gandalf and Frodo's conversation, is also chosen as a companion.",
            "_key": "CHAP_03"
        },
        {
            "title": "A SHORT CUT TO MUSHROOMS",
            "position": 4,
            "summary": "Frodo, Sam, and Pippin set out from Crickhollow, taking a shortcut through the Old Forest to avoid being seen. They encounter a black rider and become lost in the forest. They are captured by Old Man Willow, a malevolent tree, but are rescued by Tom Bombadil.",
            "_key": "CHAP_04"
        },
        {
            "title": "A CONSPIRACY UNMASKED",
            "position": 5,
            "summary": "Frodo, Sam, and Pippin are invited to Tom Bombadil's house, where they meet Goldberry, his wife.  They spend the night and learn more about the Old Forest and its dangers. Merry Brandybuck joins them, having been sent ahead to Crickhollow. The hobbits reveal their knowledge of the ring and their plans to help Frodo.",
            "_key": "CHAP_05"
        },
        {
            "title": "THE OLD FOREST",
            "position": 6,
            "summary": "Tom Bombadil explains the nature of Old Man Willow and warns the hobbits about the Barrow-downs. The hobbits leave Tom's house and continue their journey, but they become lost in the Old Forest and are captured by a barrow-wight. Tom rescues them again, and they continue on their way.",
            "_key": "CHAP_06"
        },
        {
            "title": "IN THE HOUSE OF TOM BOMBADIL",
            "position": 7,
            "summary": "The hobbits spend a second night at Tom Bombadil's house, learning more about him and his strange powers. Tom is unaffected by the ring's power.  He gives the hobbits advice and teaches them a rhyme to call for his help if they are in danger.",
            "_key": "CHAP_07"
        },
        {
            "title": "FOG ON THE BARROW-DOWNS",
            "position": 8,
            "summary": "The hobbits leave Tom Bombadil's house and continue their journey towards Bree. They become lost in the fog on the Barrow-downs and are captured by barrow-wights. Frodo remembers Tom's rhyme and calls for his help, and Tom rescues them once more.",
            "_key": "CHAP_08"
        },
        {
            "title": "AT THE SIGN OF THE PRANCING PONY",
            "position": 9,
            "summary": "The hobbits arrive at Bree and stay at the Prancing Pony inn. They meet Strider, a Ranger, and encounter other travelers. Frodo accidentally reveals the ring's power, attracting unwanted attention.  They learn that Black Riders have been searching for them.",
            "_key": "CHAP_09"
        },
        {
            "title": "STRIDER",
            "position": 10,
            "summary": "Strider reveals his true identity as Aragorn, heir of Isildur, and offers to guide the hobbits. They receive a delayed letter from Gandalf, warning them about the Black Riders and confirming Strider's identity. Merry reveals that he has known about the ring for some time.",
            "_key": "CHAP_10"
        },
        {
            "title": "A KNIFE IN THE DARK",
            "position": 11,
            "summary": "Black Riders attack Crickhollow, but Fatty Bolger escapes and raises the alarm. The hobbits' ponies are stolen from the Prancing Pony's stables. Merry sees a Black Rider in Bree. Strider warns them that they are in danger and must leave immediately.",
            "_key": "CHAP_11"
        },
        {
            "title": "FLIGHT TO THE FORD",
            "position": 12,
            "summary": "The hobbits and Strider flee Bree on foot. They are pursued by Black Riders and attacked in the wilderness. Frodo is wounded by a Morgul blade. Glorfindel, an Elf-lord, arrives and helps them escape to the Ford of Bruinen, where Elrond summons a flood that washes away the pursuing Ringwraiths. Frodo is carried unconscious to Rivendell.",
            "_key": "CHAP_12"
        },
        {
            "title": "MANY MEETINGS",
            "position": 13,
            "summary": "Frodo recovers in Rivendell under Elrond's care. He is reunited with Bilbo. Gandalf arrives and explains his delay: he was held captive by Saruman.  The hobbits learn more about Aragorn's lineage and the history of the Ringwraiths.",
            "_key": "CHAP_13"
        },
        {
            "title": "THE COUNCIL OF ELROND",
            "position": 14,
            "summary": "Elrond convenes a council to discuss the fate of the One Ring.  Representatives of Elves, Dwarves, and Men are present. Glóin tells of the dwarves' troubles and a message from Sauron. The history of the Ring is recounted, and it is decided that it must be destroyed in the fires of Mount Doom. Frodo volunteers to take the Ring.",
            "_key": "CHAP_14"
        },
        {
            "title": "THE RING GOES SOUTH",
            "position": 15,
            "summary": "The Fellowship of the Ring is formed: Frodo, Sam, Gandalf, Aragorn, Boromir, Legolas, Gimli, Merry, and Pippin.  They receive gifts from Elrond and Galadriel, including Andúril for Aragorn, Sting and mithril mail for Frodo, and lembas bread. They prepare to depart Rivendell.",
            "_key": "CHAP_15"
        },
        {
            "title": "LOTHLÓRIEN",
            "position": 16,
            "summary": "The Fellowship journeys south and enters Lothlórien, the elven realm ruled by Celeborn and Galadriel. They are welcomed by the Elves and learn more about the history and dangers of the surrounding lands.  Gimli is initially blindfolded, but Galadriel later allows him to see the beauty of Lothlórien.",
            "_key": "CHAP_16"
        },
        {
            "title": "THE MIRROR OF GALADRIEL",
            "position": 17,
            "summary": "Frodo and Sam look into the Mirror of Galadriel, seeing visions of the past, present, and possible futures. Frodo sees the Eye of Sauron and is tempted to give Galadriel the Ring, but she resists. Galadriel reveals that she is the keeper of Nenya, one of the Three Elven Rings.",
            "_key": "CHAP_17"
        },
        {
            "title": "FAREWELL TO LÓRIEN",
            "position": 18,
            "summary": "The Fellowship receives gifts from Galadriel and Celeborn before departing Lothlórien.  Galadriel gives Frodo a phial containing the light of Eärendil's star. They set out on boats down the Anduin River.",
            "_key": "CHAP_18"
        },
        {
            "title": "THE GREAT RIVER",
            "position": 19,
            "summary": "The Fellowship journeys down the Anduin, passing through the Brown Lands and encountering orc archers.  They are pursued by a dark winged creature, which Legolas shoots down. Sam sees Gollum following them.",
            "_key": "CHAP_19"
        },
        {
            "title": "THE BREAKING OF THE FELLOWSHIP",
            "position": 20,
            "summary": "The Fellowship reaches the falls of Rauros and must decide whether to go to Minas Tirith or continue towards Mordor. Frodo goes off alone to make his decision, but Boromir tries to take the Ring from him. Frodo puts on the Ring and escapes. The Fellowship is scattered, and Frodo and Sam set off alone towards Mordor.",
            "_key": "CHAP_20"
        }
    ],
    "CHARACTER": [
        {
            "name": "Bilbo Baggins",
            "gender": "Male",
            "age": 111,
            "alive": true,
            "status": "Hobbit, Gentleman",
            "description": "Very rich and very peculiar, fond of his garden and the Shire, adventurous.",
            "occupation": "Retired Burglar, Author",
            "significance": "Main",
            "_key": "CHAR_01"
        },
        {
            "name": "Frodo Baggins",
            "gender": "Male",
            "age": 33,
            "alive": true,
            "status": "Hobbit, Gentleman",
            "description": "Bilbo's heir, enjoys walking in the hills and woods, reluctant adventurer.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_02"
        },
        {
            "name": "Gandalf",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Wizard",
            "description": "An old man with a long white beard and bushy eyebrows, skilled with fireworks and magic.",
            "occupation": "Wizard",
            "significance": "Main",
            "_key": "CHAR_03"
        },
        {
            "name": "Sam Gamgee",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit, Gardener",
            "description": "Gaffer Gamgee's son, works for Bilbo, loves stories and is Frodo's loyal companion.",
            "occupation": "Gardener",
            "significance": "Main",
            "_key": "CHAR_04"
        },
        {
            "name": "Ham Gamgee",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit, Gardener",
            "description": "Sam's father, known as the Gaffer, tends Bilbo's garden.",
            "occupation": "Gardener",
            "significance": "Supporting",
            "_key": "CHAR_05"
        },
        {
            "name": "Peregrin Took",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "Frodo's young friend, called Pippin.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_06"
        },
        {
            "name": "Meriadoc Brandybuck",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "Frodo's young friend, called Merry.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_07"
        },
        {
            "name": "Thorin Oakenshield",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Dwarf King",
            "description": "Descendant of kings, leader of the dwarves on the quest for treasure.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_08"
        },
        {
            "name": "Gollum",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": null,
            "description": "A loathsome creature who lives in the dark, obsessed with his Precious ring.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_09"
        },
        {
            "name": "Bandobras Took",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Known as Bullroarer, a very tall hobbit by hobbit standards.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_10"
        },
        {
            "name": "Drogo Baggins",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Frodo's father, married Primula Brandybuck.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_11"
        },
        {
            "name": "Primula Brandybuck",
            "gender": "Female",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Frodo's mother, married Drogo Baggins.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_12"
        },
        {
            "name": "Gorbadoc Brandybuck",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Primula's father, known for his generous table.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_13"
        },
        {
            "name": "Otho Sackville-Baggins",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Bilbo's relative, dislikes Bilbo and Frodo.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_14"
        },
        {
            "name": "Lobelia Sackville-Baggins",
            "gender": "Female",
            "age": 100,
            "alive": true,
            "status": "Hobbit",
            "description": "Otho's wife, dislikes Bilbo and Frodo.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_15"
        },
        {
            "name": "Tobold Hornblower",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "First grew pipe-weed in the Shire.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_16"
        },
        {
            "name": "Isengrim the Second",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Thain of the Shire during Tobold Hornblower's time.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_17"
        },
        {
            "name": "Marcho",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Fallohide brother of Blanco, one of the founders of the Shire.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_18"
        },
        {
            "name": "Blanco",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Hobbit",
            "description": "Fallohide brother of Marcho, one of the founders of the Shire.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_19"
        },
        {
            "name": "Folco Boffin",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "One of Frodo's friends.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_20"
        },
        {
            "name": "Fredegar Bolger",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "One of Frodo's friends, called Fatty.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_21"
        },
        {
            "name": "Rory Brandybuck",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "An old hobbit with sharp wits.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_22"
        },
        {
            "name": "Esmeralda Brandybuck",
            "gender": "Female",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "Rory Brandybuck's daughter-in-law.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_23"
        },
        {
            "name": "Merry Brandybuck",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "Frodo's friend, helps with the move to Crickhollow.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_24"
        },
        {
            "name": "Lotho Sackville-Baggins",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "Lobelia's sandy-haired son.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_25"
        },
        {
            "name": "Farmer Maggot",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Hobbit, Farmer",
            "description": "A stout hobbit with a round red face, keeps ferocious dogs.",
            "occupation": "Farmer",
            "significance": "Supporting",
            "_key": "CHAR_26"
        },
        {
            "name": "Mrs. Maggot",
            "gender": "Female",
            "age": null,
            "alive": true,
            "status": "Hobbit",
            "description": "Farmer Maggot's wife.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_27"
        },
        {
            "name": "Barliman Butterbur",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Man, Innkeeper",
            "description": "A short fat man with a bald head and a red face, runs the Prancing Pony.",
            "occupation": "Innkeeper",
            "significance": "Supporting",
            "_key": "CHAR_28"
        },
        {
            "name": "Nob",
            "gender": "Male",
            "age": null,
            "status": "Hobbit, Servant",
            "description": "A cheery-looking hobbit who works at the Prancing Pony.",
            "occupation": "Servant",
            "significance": "Minor",
            "_key": "CHAR_29"
        },
        {
            "name": "Bob",
            "gender": "Male",
            "age": null,
            "status": "Man, Ostler",
            "description": "Works at the Prancing Pony.",
            "occupation": "Ostler",
            "significance": "Minor",
            "_key": "CHAR_30"
        },
        {
            "name": "Bill Ferny",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Man",
            "description": "A swarthy sneering fellow with an evil name in the Bree-land.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_31"
        },
        {
            "name": "Strider",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Ranger",
            "description": "A strange-looking weather-beaten man, known as a ranger.",
            "occupation": "Ranger",
            "significance": "Main",
            "_key": "CHAR_32"
        },
        {
            "name": "Aragorn",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Ranger, Heir of Isildur",
            "description": "Strider's true name, a descendant of kings.",
            "occupation": "Ranger",
            "significance": "Main",
            "_key": "CHAR_33"
        },
        {
            "name": "Gildor Inglorion",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf",
            "description": "Leader of the Elves encountered in the Woody End.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_34"
        },
        {
            "name": "Tom Bombadil",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": null,
            "description": "A strange and merry fellow who lives in the Old Forest, master of wood, water, and hill.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_35"
        },
        {
            "name": "Goldberry",
            "gender": "Female",
            "age": null,
            "alive": true,
            "status": null,
            "description": "Tom Bombadil's wife, daughter of the River.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_36"
        },
        {
            "name": "Elrond",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf-lord",
            "description": "Lord of Rivendell, mighty among Elves and Men, a master of healing.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_37"
        },
        {
            "name": "Arwen",
            "gender": "Female",
            "age": null,
            "alive": true,
            "status": "Elf",
            "description": "Elrond's daughter, called Undómiel, Evenstar of her people.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_38"
        },
        {
            "name": "Glóin",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "A dwarf with a long white beard, one of Thorin's companions.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_39"
        },
        {
            "name": "Gimli",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "Glóin's son.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_40"
        },
        {
            "name": "Boromir",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Man of Gondor",
            "description": "A tall man with a fair and noble face, seeks counsel from Elrond.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_41"
        },
        {
            "name": "Legolas",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf",
            "description": "A messenger from Thranduil, King of the Elves of Northern Mirkwood.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_42"
        },
        {
            "name": "Glorfindel",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf-lord",
            "description": "Dwells in Rivendell, sent to look for Frodo.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_43"
        },
        {
            "name": "Sauron",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dark Lord",
            "description": "The Enemy, the Dark Lord of Mordor.",
            "occupation": null,
            "significance": "Main",
            "_key": "CHAR_44"
        },
        {
            "name": "Gil-galad",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Elf-king",
            "description": "Last of the great Elf-kings of Middle-earth.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_45"
        },
        {
            "name": "Elendil",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "King of Men",
            "description": "Overthrew Sauron with Gil-galad.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_46"
        },
        {
            "name": "Isildur",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "King of Men",
            "description": "Elendil's son, cut the Ring from Sauron's hand.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_47"
        },
        {
            "name": "Sméagol",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": null,
            "description": "Gollum's original name.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_48"
        },
        {
            "name": "Déagol",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": null,
            "description": "Sméagol's friend, found the Ring.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_49"
        },
        {
            "name": "Celeborn",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf-lord",
            "description": "Lord of Lothlórien, Galadriel's husband.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_50"
        },
        {
            "name": "Galadriel",
            "gender": "Female",
            "age": null,
            "alive": true,
            "status": "Elf-lady",
            "description": "Lady of Lothlórien, keeper of Nenya, one of the Three Rings.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_51"
        },
        {
            "name": "Haldir",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf",
            "description": "An Elf of Lothlórien who guides the Company.",
            "occupation": null,
            "significance": "Supporting",
            "_key": "CHAR_52"
        },
        {
            "name": "Rúmil",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf",
            "description": "Haldir's brother, an Elf of Lothlórien.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_53"
        },
        {
            "name": "Orophin",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Elf",
            "description": "Haldir's brother, an Elf of Lothlórien.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_54"
        },
        {
            "name": "Balin",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Dwarf",
            "description": "Led an expedition to Moria.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_55"
        },
        {
            "name": "Ori",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Dwarf",
            "description": "Went with Balin to Moria.",
            "occupation": "Scribe",
            "significance": "Minor",
            "_key": "CHAR_56"
        },
        {
            "name": "Óin",
            "gender": "Male",
            "age": null,
            "alive": false,
            "status": "Dwarf",
            "description": "Went with Balin to Moria.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_57"
        },
        {
            "name": "Dwalin",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "One of Thorin's companions, still with Dáin.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_58"
        },
        {
            "name": "Dori",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "One of Thorin's companions, still with Dáin.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_59"
        },
        {
            "name": "Nori",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "One of Thorin's companions, still with Dáin.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_60"
        },
        {
            "name": "Bifur",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "One of Thorin's companions, still with Dáin.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_61"
        },
        {
            "name": "Bofur",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "One of Thorin's companions, still with Dáin.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_62"
        },
        {
            "name": "Bombur",
            "gender": "Male",
            "age": null,
            "alive": true,
            "status": "Dwarf",
            "description": "One of Thorin's companions, still with Dáin, now very fat.",
            "occupation": null,
            "significance": "Minor",
            "_key": "CHAR_63"
        },
        {
            "name": "Dáin",
            "gender": "Male",
            "age": 250,
            "alive": true,
            "status": "Dwarf King",
            "description": "King under the Mountain.",
            "occupation": "King",
            "significance": "Minor",
            "_key": "CHAR_64"
        }
    ],
    "CREATURE": [
        {
            "name": "Elves",
            "description": "Fair folk, often associated with magic, music, and immortality.  Various kinds of Elves are mentioned, including High Elves (considered the fairest), Wood-elves, and Silvan Elves.",
            "significance": "Appear throughout the narrative, often aiding the hobbits. They represent the fading magic and ancient wisdom of Middle-earth.",
            "_key": "CREA_01"
        },
        {
            "name": "Dwarves",
            "description": "Stout, skilled craftspeople and miners. Value tradition, craftsmanship, and treasure.",
            "significance": "Bilbo's original adventure involved dwarves, and Gimli represents the dwarves in the Fellowship. They play a role in the history and lore of Middle-earth.",
            "_key": "CREA_02"
        },
        {
            "name": "Hobbits",
            "description": "Small, peace-loving folk, fond of simple pleasures like food, drink, and gardening.",
            "significance": "The main protagonists of the story. Their involvement in the events surrounding the Ring is unexpected and significant.",
            "_key": "CREA_03"
        },
        {
            "name": "Men",
            "description": "The race of Men is diverse, including the Dúnedain (descendants of Númenor), the Rohirrim (Horse-lords), and other groups.",
            "significance": "Play various roles, both good and evil.  Aragorn and Boromir represent Men in the Fellowship.",
            "_key": "CREA_04"
        },
        {
            "name": "Dark Lord",
            "description": "Sauron, the primary antagonist, a powerful and evil being seeking to dominate Middle-earth.",
            "significance": "The driving force behind the conflict. His search for the One Ring is the central plot point.",
            "_key": "CREA_05"
        },
        {
            "name": "Orcs",
            "description": "Savage, brutal creatures serving the Dark Lord.",
            "significance": "Common enemies encountered throughout the journey. They represent the destructive forces of the Enemy.",
            "_key": "CREA_06"
        },
        {
            "name": "Trolls",
            "description": "Large, dim-witted creatures, often associated with Orcs.",
            "significance": "Appear as occasional enemies.  The stone trolls encountered by the hobbits are a reminder of Bilbo's past adventure.",
            "_key": "CREA_07"
        },
        {
            "name": "Dragons",
            "description": "Powerful, winged reptiles, often guarding treasure.",
            "significance": "Mentioned in connection with Bilbo's past adventures and the history of Middle-earth. Smaug's destruction is a key event in The Hobbit.",
            "_key": "CREA_08"
        },
        {
            "name": "Ringwraiths",
            "description": "Also called Black Riders or Nazgûl, the Nine servants of the Dark Lord, corrupted by the Nine Rings.",
            "significance": "The most active and visible agents of Sauron in pursuit of the Ring. They are a constant threat to Frodo and the Company.",
            "_key": "CREA_09"
        },
        {
            "name": "Gollum",
            "description": "A wretched creature corrupted by the One Ring, formerly a hobbit-like being.",
            "significance": "Plays a crucial role in the Ring's history, having possessed it for many years. His actions have significant consequences for the story.",
            "_key": "CREA_10"
        },
        {
            "name": "Wizard",
            "description": "Powerful beings with magical abilities, such as Gandalf and Saruman.",
            "significance": "Gandalf is a crucial mentor and guide for the hobbits. Saruman's betrayal is a major turning point.",
            "_key": "CREA_11"
        },
        {
            "name": "Rangers",
            "description": "Wanderers and protectors of the wild lands, such as Aragorn (Strider).",
            "significance": "Aragorn's role as a Ranger and heir of Isildur is central to the story. The Rangers play a vital role in protecting the Free Peoples.",
            "_key": "CREA_12"
        },
        {
            "name": "Tree-men",
            "description": "Giants, as big as trees, mentioned in rumors.",
            "significance": "Part of the growing sense of unease and the changing world. Their actual appearance is not confirmed in this part of the story.",
            "_key": "CREA_13"
        },
        {
            "name": "Wolves",
            "description": "Predatory animals, sometimes allied with Orcs (wargs).",
            "significance": "Appear as enemies, particularly in the attack on the Company's camp outside Moria.",
            "_key": "CREA_14"
        },
        {
            "name": "Barrow-wights",
            "description": "Evil spirits inhabiting ancient barrows.",
            "significance": "Encountered by the hobbits on the Barrow-downs. They represent the ancient evils that linger in Middle-earth.",
            "_key": "CREA_15"
        },
        {
            "name": "Tom Bombadil",
            "description": "A mysterious and ancient being, master of wood, water, and hill.",
            "significance": "Encounters the hobbits in the Old Forest and aids them. He is unaffected by the Ring's power.",
            "_key": "CREA_16"
        },
        {
            "name": "Goldberry",
            "description": "Tom Bombadil's wife, the River-daughter.",
            "significance": "Associated with the natural world and the beauty of Lothlórien.",
            "_key": "CREA_17"
        },
        {
            "name": "Old Man Willow",
            "description": "A malevolent tree in the Old Forest.",
            "significance": "Represents the dangers of the Old Forest and the hostility of nature towards intruders.",
            "_key": "CREA_18"
        },
        {
            "name": "Watcher in the Water",
            "description": "A creature lurking in the lake outside Moria.",
            "significance": "Guards the West-gate of Moria and attacks the Company. Its nature is unknown.",
            "_key": "CREA_19"
        },
        {
            "name": "Balrog",
            "description": "A powerful demon of fire and shadow, Durin's Bane.",
            "significance": "A major antagonist encountered in Moria. Its appearance leads to Gandalf's fall.",
            "_key": "CREA_20"
        },
        {
            "name": "Crebain",
            "description": "Large black crows, possibly spies.",
            "significance": "Seen flying over Hollin, raising suspicions of surveillance and the Enemy's growing awareness.",
            "_key": "CREA_21"
        }
    ],
    "LOCATION": [
        {
            "name": "Mordor",
            "type": "Land",
            "region": "Middle-earth",
            "description": "Also known as the Black Land and the Land of Shadow, Mordor is a dark and desolate land ruled by the Dark Lord Sauron. It is dominated by the volcanic Mount Doom and the fortress of Barad-dûr.  The land is filled with Sauron's servants, including Orcs, trolls, and Ringwraiths.",
            "significance": "The ultimate destination of Frodo's quest to destroy the One Ring.",
            "_key": "LOCA_01"
        },
        {
            "name": "Shire",
            "type": "Region",
            "region": "Middle-earth",
            "description": "A peaceful and idyllic land inhabited by hobbits. It is characterized by rolling hills, green fields, and the hobbit-holes where they dwell. The Shire is largely isolated from the outside world and its troubles.",
            "significance": "Frodo's homeland and a symbol of peace and simplicity, which he must leave to protect.",
            "_key": "LOCA_02"
        },
        {
            "name": "Hobbiton",
            "type": "Village",
            "region": "The Shire",
            "description": "A village within the Shire, home to Bilbo and Frodo Baggins at Bag End. It is the location of Bilbo's eleventy-first birthday party, which marks the beginning of Frodo's journey.",
            "significance": "The starting point of Frodo's adventure and a representation of the comfortable life he leaves behind.",
            "_key": "LOCA_03"
        },
        {
            "name": "Bag End",
            "type": "Hobbit-hole",
            "region": "Hobbiton, The Shire",
            "description": "Bilbo and Frodo's home, a luxurious hobbit-hole built into The Hill. It is known for its beautiful gardens and rumored to contain vast treasures.",
            "significance": "A symbol of hobbit comfort and Frodo's inheritance, which he must abandon.",
            "_key": "LOCA_04"
        },
        {
            "name": "Bywater",
            "type": "Village",
            "region": "The Shire",
            "description": "A village near Hobbiton, located beside a grey pool. It is mentioned as a place where news and rumors travel.",
            "significance": "Part of the Shire community and a place where the news of Bilbo's party spreads.",
            "_key": "LOCA_05"
        },
        {
            "name": "Buckland",
            "type": "Region",
            "region": "The Shire",
            "description": "A region on the eastern borders of the Shire, settled by hobbits who are fond of boats and swimming. It is separated from the Old Forest by the High Hay hedge.",
            "significance": "Frodo's childhood home and the location of Crickhollow, where he initially plans to move.",
            "_key": "LOCA_06"
        },
        {
            "name": "Brandy Hall",
            "type": "Residence",
            "region": "Buckland, The Shire",
            "description": "The ancestral home of the Brandybuck family, a large and crowded residence with numerous hobbit-holes and buildings.",
            "significance": "Frodo's childhood home and a symbol of the Brandybuck family.",
            "_key": "LOCA_07"
        },
        {
            "name": "Old Forest",
            "type": "Forest",
            "region": "Middle-earth",
            "description": "A dark and ancient forest bordering Buckland, known for its unfriendly trees and strange creatures. The hobbits take a dangerous shortcut through it to avoid the Black Riders.",
            "significance": "A place of peril and the first obstacle Frodo and his companions face after leaving the Shire.",
            "_key": "LOCA_08"
        },
        {
            "name": "Bree",
            "type": "Village",
            "region": "Bree-land, Middle-earth",
            "description": "A village located east of the Shire, inhabited by both Men and hobbits. It is the location of the Prancing Pony inn, where the hobbits meet Strider.",
            "significance": "A key location where the hobbits encounter other races and learn more about the dangers they face.",
            "_key": "LOCA_09"
        },
        {
            "name": "Prancing Pony",
            "type": "Inn",
            "region": "Bree, Bree-land",
            "description": "An inn in Bree, run by Barliman Butterbur. It is a meeting place for various folk, including hobbits, Men, dwarves, and Rangers.",
            "significance": "The site of Frodo's accidental reveal of the Ring and their meeting with Strider.",
            "_key": "LOCA_10"
        },
        {
            "name": "Crickhollow",
            "type": "House",
            "region": "Buckland, The Shire",
            "description": "A small house purchased by Frodo as a decoy for his departure from the Shire. It is located in the country beyond Bucklebury.",
            "significance": "Part of Frodo's plan to leave the Shire secretly, but it is attacked by the Black Riders.",
            "_key": "LOCA_11"
        },
        {
            "name": "Rivendell",
            "type": "Valley",
            "region": "Middle-earth",
            "description": "Also known as Imladris, Rivendell is a hidden valley and the home of Elrond Halfelven. It is a place of peace and healing, where the Council of Elrond takes place.",
            "significance": "A refuge for the hobbits and a place of wisdom and counsel, where the fate of the Ring is decided.",
            "_key": "LOCA_12"
        },
        {
            "name": "Weathertop",
            "type": "Hill",
            "region": "Middle-earth",
            "description": "A hill with the ruins of Amon Sûl, a watchtower built by the Men of the West. It offers a wide view of the surrounding lands.",
            "significance": "The site of the hobbits' camp where they are attacked by the Ringwraiths and Frodo is wounded.",
            "_key": "LOCA_13"
        },
        {
            "name": "Midgewater Marshes",
            "type": "Marshes",
            "region": "Middle-earth",
            "description": "A desolate and unpleasant marshland that the hobbits must cross on their journey. It is infested with midges and other unpleasant creatures.",
            "significance": "A challenging and uncomfortable part of the hobbits' journey.",
            "_key": "LOCA_14"
        },
        {
            "name": "Barrow-downs",
            "type": "Hills",
            "region": "Middle-earth",
            "description": "A range of hills with ancient barrows and Barrow-wights. The hobbits encounter danger and are captured by a Barrow-wight.",
            "significance": "A place of ancient evil and a perilous encounter for the hobbits.",
            "_key": "LOCA_15"
        },
        {
            "name": "Lothlórien",
            "type": "Forest",
            "region": "Middle-earth",
            "description": "Also known as Lórien, it is a beautiful elven forest ruled by Celeborn and Galadriel. It is a place of peace and refuge, where the hobbits receive gifts and counsel.",
            "significance": "A place of respite and replenishment for the hobbits, where they gain valuable allies and supplies.",
            "_key": "LOCA_16"
        },
        {
            "name": "Caras Galadhon",
            "type": "City",
            "region": "Lothlórien",
            "description": "The elven city in Lothlórien, home to Celeborn and Galadriel. It is a place of great beauty and wonder, built among the mallorn trees.",
            "significance": "The center of Lothlórien and the location of Galadriel's Mirror.",
            "_key": "LOCA_17"
        },
        {
            "name": "Moria",
            "type": "Mines",
            "region": "Misty Mountains, Middle-earth",
            "description": "Also known as Khazad-dûm, Moria is an ancient dwarven city that has become dark and dangerous. The Company travels through it to avoid the Redhorn Gate.",
            "significance": "A place of ancient dwarven history and a perilous shortcut for the Company, where Gandalf falls.",
            "_key": "LOCA_18"
        },
        {
            "name": "Dimrill Dale",
            "type": "Valley",
            "region": "Misty Mountains, Middle-earth",
            "description": "A valley at the east of Moria, containing the Mirrormere and the source of the Silverlode River.",
            "significance": "The location of Durin's Stone and the place where Balin fell.",
            "_key": "LOCA_19"
        },
        {
            "name": "Mirrormere",
            "type": "Lake",
            "region": "Dimrill Dale, Misty Mountains",
            "description": "A dark, still lake in Dimrill Dale, where Durin first saw his reflection and the crown of stars.",
            "significance": "A place of dwarven legend and a reminder of their lost kingdom.",
            "_key": "LOCA_20"
        },
        {
            "name": "Redhorn Gate",
            "type": "Mountain Pass",
            "region": "Misty Mountains, Middle-earth",
            "description": "A high and dangerous pass through the Misty Mountains, located under the far side of Caradhras.",
            "significance": "The intended route of the Company, but they are forced to turn back due to the snowstorm.",
            "_key": "LOCA_21"
        },
        {
            "name": "Isengard",
            "type": "Fortress",
            "region": "Middle-earth",
            "description": "A fortress located in a circular valley surrounded by sheer rocks, with the tower of Orthanc at its center. It is the home of Saruman.",
            "significance": "The place where Gandalf is imprisoned by Saruman.",
            "_key": "LOCA_22"
        },
        {
            "name": "Rohan",
            "type": "Land",
            "region": "Middle-earth",
            "description": "Also known as the Riddermark, Rohan is a land of plains and horses, ruled by Théoden. It is located west of the Emyn Muil and the Great River.",
            "significance": "A potential destination for the Company and a land known for its skilled horsemen.",
            "_key": "LOCA_23"
        },
        {
            "name": "Emyn Muil",
            "type": "Hills",
            "region": "Middle-earth",
            "description": "A range of bleak hills located east of the Great River, bordering the Dead Marshes and the Noman-lands.",
            "significance": "A difficult and dangerous region that the hobbits must cross after leaving Lothlórien.",
            "_key": "LOCA_24"
        },
        {
            "name": "Rauros",
            "type": "Waterfalls",
            "region": "Anduin River, Middle-earth",
            "description": "Great cataracts where the Anduin River falls from Nen Hithoel into the Nindalf (Wetwang).",
            "significance": "A major landmark on the Anduin and a point where the Fellowship must decide their course.",
            "_key": "LOCA_25"
        },
        {
            "name": "Amon Hen",
            "type": "Hill",
            "region": "Emyn Muil, Middle-earth",
            "description": "One of the three peaks at the southern end of Nen Hithoel, known as the Hill of Sight. It has an ancient high seat and offers a wide view of the surrounding lands.",
            "significance": "The location of the Seat of Seeing, where Frodo is tempted by the Ring and decides to leave the Fellowship.",
            "_key": "LOCA_26"
        },
        {
            "name": "Gondor",
            "type": "Kingdom",
            "region": "Middle-earth",
            "description": "A kingdom of Men, once powerful but now waning. Its capital is Minas Tirith.",
            "significance": "Boromir's homeland and a potential destination for the Company.",
            "_key": "LOCA_27"
        },
        {
            "name": "Minas Tirith",
            "type": "City",
            "region": "Gondor",
            "description": "The capital city of Gondor, a white-walled fortress built on a mountain. It is a symbol of Gondor's strength and resistance against Mordor.",
            "significance": "Boromir's home and a potential destination for the Company, though ultimately not where the Ring goes.",
            "_key": "LOCA_28"
        }
    ],
    "ITEM": [
        {
            "name": "One Ring",
            "type": "Artifact",
            "magical": true,
            "description": "A ring of gold that makes its wearer invisible and grants power according to their stature. It corrupts the hearts of those who possess it, especially mortals, and its primary effect on them is to extend their lifespan while diminishing their vitality. It also draws the Ringwraiths towards its bearer.",
            "origin": "Forged by Sauron in the fires of Mount Doom to control all other Rings of Power.",
            "current_status": "In Frodo's possession",
            "_key": "ITEM_01"
        },
        {
            "name": "Three Elven Rings",
            "type": "Artifact",
            "magical": true,
            "description": "Three rings made by Celebrimbor, hidden from Sauron, and untainted by his touch. They grant the power of understanding, making, and healing, and help to preserve all things unstained.",
            "origin": "Forged by Celebrimbor in Eregion.",
            "current_status": "Hidden and in the possession of their keepers.",
            "_key": "ITEM_02"
        },
        {
            "name": "Seven Dwarf Rings",
            "type": "Artifact",
            "magical": true,
            "description": "Rings given to the Dwarf-lords. Their ultimate fate is unknown, but some were consumed by dragons and three were recovered by Sauron.",
            "origin": "Forged by Celebrimbor in Eregion.",
            "current_status": "Mostly lost or destroyed.",
            "_key": "ITEM_03"
        },
        {
            "name": "Nine Rings for Mortal Men",
            "type": "Artifact",
            "magical": true,
            "description": "Rings given to Men, who were ensnared by their power and became the Ringwraiths.",
            "origin": "Forged by Celebrimbor in Eregion.",
            "current_status": "Controlled by Sauron.",
            "_key": "ITEM_04"
        },
        {
            "name": "Sting",
            "type": "Weapon",
            "magical": true,
            "description": "An Elvish knife/short sword that glows blue when Orcs are near.",
            "origin": "Found in a troll-hoard.",
            "current_status": "Given to Frodo by Bilbo.",
            "_key": "ITEM_05"
        },
        {
            "name": "Mithril Coat",
            "type": "Armor",
            "magical": false,
            "description": "A shirt of mail made of mithril, light and strong, able to turn even the knives of the Black Riders.",
            "origin": "A gift from Thorin to Bilbo.",
            "current_status": "Given to Frodo by Bilbo.",
            "_key": "ITEM_06"
        },
        {
            "name": "Andúril",
            "type": "Weapon",
            "magical": true,
            "description": "The reforged sword of Elendil, broken in the battle against Sauron. It shines with the light of the sun and moon, and has a keen edge.",
            "origin": "Reforged from the shards of Narsil.",
            "current_status": "In Aragorn's possession.",
            "_key": "ITEM_07"
        },
        {
            "name": "Glamdring",
            "type": "Weapon",
            "magical": true,
            "description": "An Elvish sword, mate of Orcrist, that glows with a cold light when Orcs are near.",
            "origin": "Found in a troll-hoard.",
            "current_status": "In Gandalf's possession.",
            "_key": "ITEM_08"
        },
        {
            "name": "Orcrist",
            "type": "Weapon",
            "magical": true,
            "description": "An Elvish sword, mate of Glamdring, that glows with a cold light when Orcs are near.",
            "origin": "Found in a troll-hoard.",
            "current_status": "On Thorin's tomb under the Lonely Mountain.",
            "_key": "ITEM_09"
        },
        {
            "name": "Morgul Knife",
            "type": "Weapon",
            "magical": true,
            "description": "A knife used by the Ringwraiths. If it pierces the heart of a victim, they become like the Ringwraiths, only weaker and under their command.",
            "origin": "Likely from Mordor.",
            "current_status": "Broken by Frodo, fragment removed by Elrond.",
            "_key": "ITEM_10"
        },
        {
            "name": "Horn of Gondor",
            "type": "Tool",
            "magical": false,
            "description": "Boromir's war-horn. Its sound is loud and clear and echoes in the valleys of the hills.",
            "origin": "From Gondor.",
            "current_status": "In Boromir's possession.",
            "_key": "ITEM_11"
        },
        {
            "name": "Elven Rope",
            "type": "Tool",
            "magical": false,
            "description": "Rope made of hithlain, strong and light, given by the Elves of Lothlórien.",
            "origin": "Made in Lothlórien.",
            "current_status": "Given to the Company.",
            "_key": "ITEM_12"
        },
        {
            "name": "Phial of Galadriel",
            "type": "Artifact",
            "magical": true,
            "description": "A small crystal phial containing the light of Eärendil's star, set amid the waters of Galadriel's fountain. It shines brighter in dark places.",
            "origin": "Made by Galadriel in Lothlórien.",
            "current_status": "Given to Frodo.",
            "_key": "ITEM_13"
        },
        {
            "name": "Nenya",
            "type": "Artifact",
            "magical": true,
            "description": "One of the Three Elven Rings, the Ring of Adamant. It is made of mithril and has a white stone that twinkles.",
            "origin": "Made by Celebrimbor in Eregion.",
            "current_status": "Worn by Galadriel.",
            "_key": "ITEM_14"
        },
        {
            "name": "Lembas",
            "type": "Food",
            "magical": false,
            "description": "Elven waybread, more strengthening than any food made by Men. One cake can keep a traveler on his feet for a day of long labor.",
            "origin": "Made by the Elves of Lothlórien.",
            "current_status": "Given to the Company.",
            "_key": "ITEM_15"
        },
        {
            "name": "Elvish Cloaks",
            "type": "Clothing",
            "magical": false,
            "description": "Cloaks made of a light but warm silken stuff woven by the Galadhrim. They are grey, green, brown, or silver depending on the light, and help to keep the wearer hidden.",
            "origin": "Made in Lothlórien.",
            "current_status": "Given to the Company.",
            "_key": "ITEM_16"
        },
        {
            "name": "Book of Mazarbul",
            "type": "Book",
            "magical": false,
            "description": "A record of the fortunes of Balin's folk in Moria, written by many different hands.",
            "origin": "Written by Balin's folk in Moria.",
            "current_status": "Found by the Company.",
            "_key": "ITEM_17"
        },
        {
            "name": "Elfstone",
            "type": "Jewelry",
            "magical": false,
            "description": "A clear green stone set in a silver brooch shaped like an eagle with outspread wings. Given to Aragorn as a token of hope.",
            "origin": "Originally given by Galadriel to Celebrían, her daughter.",
            "current_status": "Given to Aragorn.",
            "_key": "ITEM_18"
        }
    ]
}