{
  "ORGANIZATION": [
    {
      "name": "Bomoo.com",
      "type": "organization",
      "description": "Ebook publisher",
      "significance": "Published the ebook.",
      "_key": "ORGA_01"
    },
    {
      "name": "International Astronomical Congress",
      "type": "organization",
      "description": "A group of astronomers",
      "significance": "The Turkish astronomer presented his discovery to them.",
      "_key": "ORGA_02"
    }
  ],
  "CHAPTER": [
    {
      "title": "Chapter 1",
      "position": 1,
      "summary": "The narrator, a pilot, reflects on his childhood drawing experiences and the difficulty of being understood by adults. He shares his early drawings of a boa constrictor digesting an elephant and how adults failed to understand them. He then describes his encounters with adults and their limited perspectives.",
      "_key": "CHAP_01"
    },
    {
      "title": "Chapter 2",
      "position": 2,
      "summary": "The narrator crashes his plane in the Sahara Desert and encounters the little prince. The little prince asks the narrator to draw a sheep, leading to a series of drawings and conversations. The narrator learns about the little prince's origins and his unique perspective on the world.",
      "_key": "CHAP_02"
    },
    {
      "title": "Chapter 3",
      "position": 3,
      "summary": "The narrator learns more about the little prince's origins, including his planet and his relationship with his sheep. The little prince's questions and observations reveal his unique perspective on the world and his connection to his planet.",
      "_key": "CHAP_03"
    },
    {
      "title": "Chapter 4",
      "position": 4,
      "summary": "The narrator speculates about the little prince's planet, Asteroid B-612, and the importance of understanding things beyond superficial appearances. The narrator discusses the way adults focus on numbers and facts rather than the essence of things, and the importance of seeing with the heart.",
      "_key": "CHAP_04"
    },
    {
      "title": "Chapter 5",
      "position": 5,
      "summary": "The little prince tells the narrator about the dangers of baobab trees on his planet and the importance of taking care of one's planet. The narrator draws a picture of the baobabs to warn children about the dangers of neglecting their responsibilities.",
      "_key": "CHAP_05"
    },
    {
      "title": "Chapter 6",
      "position": 6,
      "summary": "The little prince and the narrator discuss sunsets and the little prince's fondness for them. The little prince reveals that he loves sunsets when he is sad, and the narrator begins to understand the little prince's emotional depth.",
      "_key": "CHAP_06"
    },
    {
      "title": "Chapter 7",
      "position": 7,
      "summary": "The narrator learns about the secret of the little prince's life, which involves a rose and the importance of love and responsibility. The little prince explains the significance of his rose and the pain he feels when he thinks about the possibility of his sheep eating it.",
      "_key": "CHAP_07"
    },
    {
      "title": "Chapter 8",
      "position": 8,
      "summary": "The narrator learns about the rose that the little prince loves and the complexities of their relationship. The rose is described as vain and demanding, but also beautiful and unique. The little prince reflects on his relationship with the rose and his regrets about not understanding her.",
      "_key": "CHAP_08"
    },
    {
      "title": "Chapter 9",
      "position": 9,
      "summary": "The little prince decides to leave his planet and sets out on a journey. He prepares his planet for his departure, including cleaning his volcanoes and saying goodbye to his rose. The rose expresses her love for him and encourages him to be happy.",
      "_key": "CHAP_09"
    },
    {
      "title": "Chapter 10",
      "position": 10,
      "summary": "The little prince visits a king who rules over everything but has no real power. The king orders the little prince to yawn and then makes him a minister. The little prince realizes the absurdity of the king's authority and continues his journey.",
      "_key": "CHAP_10"
    },
    {
      "title": "Chapter 11",
      "position": 11,
      "summary": "The little prince visits a conceited man who only cares about admiration. The conceited man wants the little prince to admire him, but the little prince finds him foolish and continues his journey.",
      "_key": "CHAP_11"
    },
    {
      "title": "Chapter 12",
      "position": 12,
      "summary": "The little prince visits a tippler who drinks to forget his shame. The little prince is saddened by the tippler's behavior and continues his journey.",
      "_key": "CHAP_12"
    },
    {
      "title": "Chapter 13",
      "position": 13,
      "summary": "The little prince visits a businessman who is obsessed with counting stars and claims to own them. The little prince questions the value of owning stars and finds the businessman's actions meaningless.",
      "_key": "CHAP_13"
    },
    {
      "title": "Chapter 14",
      "position": 14,
      "summary": "The little prince visits a lamplighter who faithfully lights and extinguishes a street lamp every minute. The little prince admires the lamplighter's dedication and finds his work meaningful, even though it is repetitive.",
      "_key": "CHAP_14"
    },
    {
      "title": "Chapter 15",
      "position": 15,
      "summary": "The little prince visits a geographer who knows about everything but has never explored anything. The geographer advises the little prince to visit Earth, and the little prince continues his journey, thinking of his flower.",
      "_key": "CHAP_15"
    },
    {
      "title": "Chapter 16",
      "position": 16,
      "summary": "The narrator reflects on the Earth and its inhabitants, including the vast number of adults. The narrator discusses the Earth's lamplighters and the beauty of their work.",
      "_key": "CHAP_16"
    },
    {
      "title": "Chapter 17",
      "position": 17,
      "summary": "The little prince meets a snake in the desert, who offers to help him return to his planet. The snake speaks in riddles and hints at the little prince's eventual return.",
      "_key": "CHAP_17"
    },
    {
      "title": "Chapter 18",
      "position": 18,
      "summary": "The little prince meets a flower in the desert who tells him about the men she has seen. The flower describes the men as rootless and difficult to find.",
      "_key": "CHAP_18"
    },
    {
      "title": "Chapter 19",
      "position": 19,
      "summary": "The little prince climbs a mountain and encounters an echo. The echo repeats his words, and he realizes the lack of imagination in the people he encounters.",
      "_key": "CHAP_19"
    },
    {
      "title": "Chapter 19",
      "position": 19,
      "summary": "The little prince climbs a mountain and encounters an echo. The echo repeats his words, and he realizes the lack of imagination in the people he encounters.",
      "_key": "CHAP_20"
    },
    {
      "title": "Chapter 20",
      "position": 20,
      "summary": "The little prince discovers a garden of roses that look like his own rose, which makes him sad. He realizes that his rose is not unique in the world, and he feels disappointed.",
      "_key": "CHAP_21"
    },
    {
      "title": "Chapter 21",
      "position": 21,
      "summary": "The little prince befriends a fox, who teaches him the meaning of taming and the importance of establishing ties. The fox reveals the secret that what is essential is invisible to the eye.",
      "_key": "CHAP_22"
    },
    {
      "title": "Chapter 22",
      "position": 22,
      "summary": "The little prince encounters a railway switchman who sorts travelers. The little prince observes the travelers' lack of satisfaction and the children's ability to find joy in simple things.",
      "_key": "CHAP_23"
    },
    {
      "title": "Chapter 23",
      "position": 23,
      "summary": "The little prince meets a merchant who sells pills that quench thirst. The little prince reflects on the value of time and the importance of enjoying life's simple pleasures.",
      "_key": "CHAP_24"
    },
    {
      "title": "Chapter 24",
      "position": 24,
      "summary": "The narrator and the little prince, thirsty, search for a well in the desert. They discuss the beauty of the desert and the importance of looking with the heart. They find a well, and the little prince drinks from it.",
      "_key": "CHAP_25"
    },
    {
      "title": "Chapter 25",
      "position": 25,
      "summary": "The little prince and the narrator discuss the little prince's return to his planet. The little prince asks the narrator to draw a muzzle for his sheep, and they reflect on their friendship and the importance of responsibility.",
      "_key": "CHAP_26"
    },
    {
      "title": "Chapter 26",
      "position": 26,
      "summary": "The little prince meets the snake and prepares to return to his planet. The little prince explains his plan to the narrator, and the narrator witnesses the little prince's departure. The little prince's final words reveal his acceptance of his fate.",
      "_key": "CHAP_27"
    },
    {
      "title": "Chapter 27",
      "position": 27,
      "summary": "The narrator reflects on the little prince's disappearance and the mystery surrounding it. The narrator wonders if the sheep ate the rose and encourages the reader to consider the importance of the little prince's story. The narrator asks the reader to look for the little prince and to send word if they find him.",
      "_key": "CHAP_28"
    }
  ],
  "CHARACTER": [
    {
      "name": "Antoine de Saint-Exupéry",
      "gender": "male",
      "age": "1900-44",
      "alive": false,
      "status": null,
      "description": "An adventurous pilot and a lyrical poet.",
      "occupation": "Pilot, Poet",
      "significance": "Main",
      "_key": "CHAR_01"
    },
    {
      "name": "The Little Prince",
      "gender": "male",
      "age": null,
      "alive": true,
      "status": null,
      "description": "A boy who lives alone on a tiny planet.",
      "occupation": null,
      "significance": "Main",
      "_key": "CHAR_02"
    },
    {
      "name": "Leon Werth",
      "gender": "male",
      "age": null,
      "alive": null,
      "status": null,
      "description": "The best friend of the narrator.",
      "occupation": null,
      "significance": "Supporting",
      "_key": "CHAR_03"
    },
    {
      "name": "Narrator",
      "gender": "male",
      "age": null,
      "alive": true,
      "status": null,
      "description": "A pilot who crashes in the desert.",
      "occupation": "Pilot",
      "significance": "Main",
      "_key": "CHAR_04"
    },
    {
      "name": "Grown-ups",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "People who never understand anything by themselves.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_05"
    },
    {
      "name": "Boa constrictor",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A snake that swallows its prey whole.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_06"
    },
    {
      "name": "Elephant",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "An animal that is swallowed by a boa constrictor.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_07"
    },
    {
      "name": "Sheep",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "An animal that the little prince wants to draw.",
      "occupation": null,
      "significance": "Supporting",
      "_key": "CHAR_08"
    },
    {
      "name": "Turkish astronomer",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "The person who discovered Asteroid B-612.",
      "occupation": "Astronomer",
      "significance": "Minor",
      "_key": "CHAR_09"
    },
    {
      "name": "Turkish dictator",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A dictator who made a law that his subjects should change to European costume.",
      "occupation": "Dictator",
      "significance": "Minor",
      "_key": "CHAR_10"
    },
    {
      "name": "Baobabs",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "Trees that can split a planet in pieces.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_11"
    },
    {
      "name": "Rose",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A flower that the little prince loves.",
      "occupation": null,
      "significance": "Supporting",
      "_key": "CHAR_12"
    },
    {
      "name": "King",
      "gender": null,
      "age": null,
      "alive": null,
      "status": "King",
      "description": "A king who rules over everything.",
      "occupation": "King",
      "significance": "Minor",
      "_key": "CHAR_13"
    },
    {
      "name": "Conceited man",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A man who wants to be admired.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_14"
    },
    {
      "name": "Tippler",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A man who drinks to forget.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_15"
    },
    {
      "name": "Businessman",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A man who owns the stars.",
      "occupation": "Businessman",
      "significance": "Minor",
      "_key": "CHAR_16"
    },
    {
      "name": "Lamplighter",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A man who lights and puts out a lamp.",
      "occupation": "Lamplighter",
      "significance": "Minor",
      "_key": "CHAR_17"
    },
    {
      "name": "Geographer",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A scholar who knows the location of all the seas, rivers, towns, mountains, and deserts.",
      "occupation": "Geographer",
      "significance": "Minor",
      "_key": "CHAR_18"
    },
    {
      "name": "Snake",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A snake that can send people back to where they came from.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_19"
    },
    {
      "name": "Flower",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A flower with three petals.",
      "occupation": null,
      "significance": "Minor",
      "_key": "CHAR_20"
    },
    {
      "name": "Fox",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A fox that the little prince tames.",
      "occupation": null,
      "significance": "Supporting",
      "_key": "CHAR_21"
    },
    {
      "name": "Railway switchman",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A man who sorts out travelers.",
      "occupation": "Railway switchman",
      "significance": "Minor",
      "_key": "CHAR_22"
    },
    {
      "name": "Merchant",
      "gender": null,
      "age": null,
      "alive": null,
      "status": null,
      "description": "A merchant who sells pills that quench thirst.",
      "occupation": "Merchant",
      "significance": "Minor",
      "_key": "CHAR_23"
    }
  ],
  "CONCEPT": [
    {
      "name": "Grown-ups vs. Children",
      "description": "The narrative contrasts the perspectives of adults and children, highlighting the limitations of adult thinking and the importance of imagination, wonder, and seeing beyond the surface. Grown-ups are often portrayed as practical, focused on numbers and superficial matters, while children possess a deeper understanding of the world and its essential truths.",
      "_key": "CONC_01"
    },
    {
      "name": "Taming and Responsibility",
      "description": "The concept of 'taming' is central to the story, representing the creation of meaningful relationships and the responsibilities that come with them. It emphasizes the importance of investing time and care in others to create unique bonds, and the lasting impact these bonds have on our lives. It also highlights the responsibility one has for those they have tamed.",
      "_key": "CONC_02"
    },
    {
      "name": "The Importance of the Heart",
      "description": "The story emphasizes the significance of looking beyond the surface and seeing with the heart. It suggests that true understanding and connection come from emotional investment and empathy, rather than relying solely on logic or reason. The essential things in life are invisible to the eye and can only be perceived through the heart.",
      "_key": "CONC_03"
    },
    {
      "name": "Loneliness and Connection",
      "description": "The narrative explores the theme of loneliness and the human need for connection. The little prince's journey through various planets reveals the isolation of individuals and the importance of finding meaningful relationships. The story suggests that true connection requires vulnerability, empathy, and a willingness to invest in others.",
      "_key": "CONC_04"
    },
    {
      "name": "The Nature of Love",
      "description": "The story explores the complexities of love, including its potential for both joy and sorrow. The little prince's relationship with the rose illustrates the challenges of love, such as vanity, misunderstanding, and the pain of loss. The story suggests that love involves responsibility, care, and a deep appreciation for the unique qualities of the beloved.",
      "_key": "CONC_05"
    },
    {
      "name": "The Value of Simplicity",
      "description": "The story contrasts the simple, essential values of the little prince with the complex, often superficial concerns of the grown-ups. It suggests that true happiness and fulfillment come from appreciating the simple things in life, such as friendship, beauty, and the natural world. The story values the importance of slowing down and appreciating the present moment.",
      "_key": "CONC_06"
    },
    {
      "name": "The Power of Imagination",
      "description": "The story celebrates the power of imagination and its role in understanding the world. The little prince's ability to see beyond the surface and his imaginative interpretations of the world contrast with the limited perspectives of the grown-ups. The story suggests that imagination is essential for creativity, empathy, and finding meaning in life.",
      "_key": "CONC_07"
    },
    {
      "name": "Mortality and Loss",
      "description": "The story touches on the themes of mortality and loss, particularly through the little prince's impending departure and the narrator's reflections on his friend. The story suggests that loss is an inevitable part of life, but that the memories and connections we create can endure beyond physical presence. The story also suggests that the little prince's death is a return to his planet.",
      "_key": "CONC_08"
    },
    {
      "name": "The Search for Meaning",
      "description": "The story is a quest for meaning in life. The little prince's journey through the planets and his encounters with various characters represent a search for understanding and purpose. The story suggests that meaning is not found in material possessions or worldly pursuits, but in relationships, experiences, and the appreciation of beauty.",
      "_key": "CONC_09"
    }
  ],
  "TIME_PERIOD": [
    {
      "name": "1900-44",
      "description": "Antoine de Saint-Exupéry's lifespan, including his birth in 1900 and death in 1944.",
      "_key": "TIME_01"
    },
    {
      "name": "1920s",
      "description": "Saint-Exupéry helped establish airmail routes overseas.",
      "_key": "TIME_02"
    },
    {
      "name": "World War II",
      "description": "Saint-Exupéry flew as a military reconnaissance pilot during this time.",
      "_key": "TIME_03"
    },
    {
      "name": "1940",
      "description": "Saint-Exupéry escaped to the United States after the Germans occupied France.",
      "_key": "TIME_04"
    },
    {
      "name": "1943",
      "description": "Saint-Exupéry rejoined the air force in North Africa.",
      "_key": "TIME_05"
    },
    {
      "name": "July 31, 1944",
      "description": "Saint-Exupéry died when his plane was shot down during a reconnaissance mission.",
      "_key": "TIME_06"
    },
    {
      "name": "1929",
      "description": "Saint-Exupery's first book, 'Southern Mail', was published in French.",
      "_key": "TIME_07"
    },
    {
      "name": "1931",
      "description": "The book 'Night Flight' was published.",
      "_key": "TIME_08"
    },
    {
      "name": "1939",
      "description": "The book 'Wind, Sand, and Stars' was published.",
      "_key": "TIME_09"
    },
    {
      "name": "1943",
      "description": "The book 'The Little Prince' was written during Saint-Exupery's stay in the United States.",
      "_key": "TIME_10"
    },
    {
      "name": "1948",
      "description": "The book 'The Wisdom of the Sands' was published after the pilot's death.",
      "_key": "TIME_11"
    },
    {
      "name": "Six years ago",
      "description": "The narrator's plane crash in the Sahara Desert.",
      "_key": "TIME_12"
    },
    {
      "name": "1909",
      "description": "The year a Turkish astronomer discovered Asteroid B-612.",
      "_key": "TIME_13"
    },
    {
      "name": "1909",
      "description": "The year a Turkish astronomer discovered Asteroid B-612.",
      "_key": "TIME_14"
    },
    {
      "name": "1920",
      "description": "The year the Turkish astronomer gave his demonstration again, dressed in European costume.",
      "_key": "TIME_15"
    }
  ],
  "ITEM": [
    {
      "name": "Drawing Number One",
      "type": "drawing",
      "description": "A drawing of a boa constrictor digesting an elephant.",
      "current_status": "exists",
      "_key": "ITEM_01"
    },
    {
      "name": "Drawing Number Two",
      "type": "drawing",
      "description": "A drawing of the inside of a boa constrictor.",
      "current_status": "exists",
      "_key": "ITEM_02"
    },
    {
      "name": "Airplane",
      "type": "tool",
      "description": "The narrator's airplane, which crashed in the desert.",
      "current_status": "broken",
      "_key": "ITEM_03"
    },
    {
      "name": "Sheet of paper",
      "type": "tool",
      "description": "Used by the narrator to draw the sheep.",
      "current_status": "used",
      "_key": "ITEM_04"
    },
    {
      "name": "Fountain-pen",
      "type": "tool",
      "description": "Used by the narrator to draw the sheep.",
      "current_status": "used",
      "_key": "ITEM_05"
    },
    {
      "name": "Sheep",
      "type": "animal",
      "description": "The little prince's sheep, which he wants the narrator to draw.",
      "current_status": "alive",
      "_key": "ITEM_06"
    },
    {
      "name": "Box",
      "type": "tool",
      "description": "The box the narrator drew for the little prince to contain the sheep.",
      "current_status": "exists",
      "_key": "ITEM_07"
    },
    {
      "name": "String",
      "type": "tool",
      "description": "The narrator offered the little prince a string to tie the sheep.",
      "current_status": "offered",
      "_key": "ITEM_08"
    },
    {
      "name": "Post",
      "type": "tool",
      "description": "The narrator offered the little prince a post to tie the sheep.",
      "current_status": "offered",
      "_key": "ITEM_09"
    },
    {
      "name": "Asteroid B-612",
      "type": "celestial body",
      "description": "The asteroid from which the little prince came.",
      "current_status": "exists",
      "_key": "ITEM_10"
    },
    {
      "name": "Box of paints",
      "type": "tool",
      "description": "Used by the narrator to draw portraits.",
      "current_status": "exists",
      "_key": "ITEM_11"
    },
    {
      "name": "Pencils",
      "type": "tool",
      "description": "Used by the narrator to draw portraits.",
      "current_status": "exists",
      "_key": "ITEM_12"
    },
    {
      "name": "Baobabs",
      "type": "plant",
      "description": "Large trees that can destroy a planet if not removed.",
      "current_status": "exists",
      "_key": "ITEM_13"
    },
    {
      "name": "Rose",
      "type": "plant",
      "description": "The little prince's unique rose, which is very vain.",
      "current_status": "alive",
      "_key": "ITEM_14"
    },
    {
      "name": "Glass globe",
      "type": "tool",
      "description": "Used to protect the rose from drafts.",
      "current_status": "exists",
      "_key": "ITEM_15"
    },
    {
      "name": "Sprinkling-can",
      "type": "tool",
      "description": "Used to water the rose.",
      "current_status": "exists",
      "_key": "ITEM_16"
    },
    {
      "name": "Active volcanoes",
      "type": "celestial body",
      "description": "The little prince had two active volcanoes on his planet.",
      "current_status": "active",
      "_key": "ITEM_17"
    },
    {
      "name": "Extinct volcano",
      "type": "celestial body",
      "description": "The little prince had one extinct volcano on his planet.",
      "current_status": "extinct",
      "_key": "ITEM_18"
    },
    {
      "name": "Ermine robe",
      "type": "clothing",
      "description": "The king's robe.",
      "current_status": "worn",
      "_key": "ITEM_19"
    },
    {
      "name": "Almanac",
      "type": "book",
      "description": "The king consulted it to determine the time of the sunset.",
      "current_status": "used",
      "_key": "ITEM_20"
    },
    {
      "name": "Hat",
      "type": "clothing",
      "description": "The conceited man's hat for salutes.",
      "current_status": "worn",
      "_key": "ITEM_21"
    },
    {
      "name": "Empty bottles",
      "type": "container",
      "description": "The tippler's empty bottles.",
      "current_status": "empty",
      "_key": "ITEM_22"
    },
    {
      "name": "Full bottles",
      "type": "container",
      "description": "The tippler's full bottles.",
      "current_status": "full",
      "_key": "ITEM_23"
    },
    {
      "name": "Cigarette",
      "type": "item",
      "description": "The businessman's cigarette.",
      "current_status": "out",
      "_key": "ITEM_24"
    },
    {
      "name": "Pills",
      "type": "item",
      "description": "Pills that quench thirst.",
      "current_status": "sold",
      "_key": "ITEM_25"
    },
    {
      "name": "Muzzle",
      "type": "tool",
      "description": "The narrator drew a muzzle for the sheep.",
      "current_status": "drawn",
      "_key": "ITEM_26"
    },
    {
      "name": "Revolver",
      "type": "weapon",
      "description": "The narrator's revolver.",
      "current_status": "present",
      "_key": "ITEM_27"
    },
    {
      "name": "Golden muffler",
      "type": "clothing",
      "description": "The little prince's muffler.",
      "current_status": "worn",
      "_key": "ITEM_28"
    },
    {
      "name": "Poison",
      "type": "item",
      "description": "The snake's poison.",
      "current_status": "present",
      "_key": "ITEM_29"
    },
    {
      "name": "Rag doll",
      "type": "toy",
      "description": "The children's toy.",
      "current_status": "used",
      "_key": "ITEM_30"
    }
  ],
  "LOCATION": [
    {
      "name": "Lyon, France",
      "type": "city",
      "region": "France",
      "description": "Lyon is the birthplace of Antoine de Saint-Exupéry. It is where he was born on June 29, 1900. The city is mentioned in the biography of the author.",
      "significance": "Birthplace of the author.",
      "_key": "LOCA_01"
    },
    {
      "name": "United States",
      "type": "country",
      "region": "North America",
      "description": "Antoine de Saint-Exupéry escaped to the United States after the Germans occupied France in 1940. He wrote 'The Little Prince' during his stay in the United States.",
      "significance": "Where the author wrote 'The Little Prince'.",
      "_key": "LOCA_02"
    },
    {
      "name": "North Africa",
      "type": "region",
      "description": "Antoine de Saint-Exupéry rejoined the air force in North Africa in 1943. This is mentioned in the biography of the author.",
      "significance": "Location where the author served in the air force.",
      "_key": "LOCA_03"
    },
    {
      "name": "Mediterranean Sea",
      "type": "sea",
      "description": "The author died when his plane was shot down over the Mediterranean Sea on July 31, 1944. This is mentioned in the biography of the author.",
      "significance": "Location of the author's death.",
      "_key": "LOCA_04"
    },
    {
      "name": "France",
      "type": "country",
      "region": "Europe",
      "description": "The author's friend, Leon Werth, lives in France. The book is dedicated to him. The narrator mentions that when it is noon in the United States, the sun is setting over France.",
      "significance": "Where the author's friend lives.",
      "_key": "LOCA_05"
    },
    {
      "name": "Desert of Sahara",
      "type": "desert",
      "region": "Africa",
      "description": "The narrator crashes his plane in the Desert of Sahara. This is where he meets the little prince. The desert is described as a vast and isolated place.",
      "significance": "Where the narrator meets the little prince and the main setting of the story.",
      "_key": "LOCA_06"
    },
    {
      "name": "Ocean",
      "type": "ocean",
      "description": "The narrator compares his isolation in the desert to that of a shipwrecked sailor on a raft in the middle of the ocean.",
      "significance": "Used for comparison to describe the narrator's isolation.",
      "_key": "LOCA_07"
    },
    {
      "name": "China",
      "type": "country",
      "region": "Asia",
      "description": "The narrator mentions that he can distinguish China from Arizona at a glance.",
      "significance": "Used for comparison to show the narrator's geographical knowledge.",
      "_key": "LOCA_08"
    },
    {
      "name": "Arizona",
      "type": "state",
      "region": "United States",
      "description": "The narrator mentions that he can distinguish China from Arizona at a glance.",
      "significance": "Used for comparison to show the narrator's geographical knowledge.",
      "_key": "LOCA_09"
    },
    {
      "name": "Asteroid B-612",
      "type": "asteroid",
      "description": "The little prince comes from Asteroid B-612. It is described as being scarcely any larger than a house. The narrator provides details about the asteroid's discovery.",
      "significance": "The little prince's home planet.",
      "_key": "LOCA_10"
    },
    {
      "name": "Earth",
      "type": "planet",
      "description": "The seventh planet visited by the little prince. The Earth is described as having many inhabitants, including kings, geographers, businessmen, and conceited men. The little prince meets a snake, a flower, a fox, and other characters on Earth.",
      "significance": "The planet where the little prince meets many characters and learns important lessons.",
      "_key": "LOCA_11"
    },
    {
      "name": "Asteroids 325, 326, 327, 328, 329, and 330",
      "type": "asteroids",
      "description": "The little prince visits these asteroids after leaving his own planet. They are inhabited by various characters, including a king, a conceited man, a tippler, a businessman, and a lamplighter.",
      "significance": "The planets the little prince visits on his journey.",
      "_key": "LOCA_12"
    },
    {
      "name": "New Zealand",
      "type": "country",
      "region": "Oceania",
      "description": "The narrator mentions the lamplighters of New Zealand as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_13"
    },
    {
      "name": "Australia",
      "type": "country",
      "region": "Oceania",
      "description": "The narrator mentions the lamplighters of Australia as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_14"
    },
    {
      "name": "China",
      "type": "country",
      "region": "Asia",
      "description": "The narrator mentions the lamplighters of China as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_15"
    },
    {
      "name": "Siberia",
      "type": "region",
      "region": "Asia",
      "description": "The narrator mentions the lamplighters of Siberia as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_16"
    },
    {
      "name": "Russia",
      "type": "country",
      "region": "Europe/Asia",
      "description": "The narrator mentions the lamplighters of Russia as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_17"
    },
    {
      "name": "Indies",
      "type": "region",
      "region": "Asia",
      "description": "The narrator mentions the lamplighters of the Indies as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_18"
    },
    {
      "name": "Africa",
      "type": "continent",
      "description": "The narrator mentions the lamplighters of Africa as part of the Earth's lamplighter army. The snake tells the little prince that he is in Africa.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_19"
    },
    {
      "name": "Europe",
      "type": "continent",
      "description": "The narrator mentions the lamplighters of Europe as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_20"
    },
    {
      "name": "South America",
      "type": "continent",
      "description": "The narrator mentions the lamplighters of South America as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_21"
    },
    {
      "name": "North America",
      "type": "continent",
      "description": "The narrator mentions the lamplighters of North America as part of the Earth's lamplighter army.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_22"
    },
    {
      "name": "North Pole",
      "type": "location",
      "description": "The narrator mentions the lamplighter at the North Pole.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_23"
    },
    {
      "name": "South Pole",
      "type": "location",
      "description": "The narrator mentions the lamplighter at the South Pole.",
      "significance": "Used to illustrate the size of the Earth.",
      "_key": "LOCA_24"
    },
    {
      "name": "Africa",
      "type": "continent",
      "description": "The snake tells the little prince that he is in Africa.",
      "significance": "The location where the little prince meets the snake.",
      "_key": "LOCA_25"
    },
    {
      "name": "Mountain",
      "type": "mountain",
      "description": "The little prince climbs a high mountain on Earth.",
      "significance": "The little prince tries to see the whole planet from the mountain.",
      "_key": "LOCA_26"
    },
    {
      "name": "Garden",
      "type": "garden",
      "description": "The little prince discovers a garden of roses on Earth.",
      "significance": "The little prince realizes that his rose is unique.",
      "_key": "LOCA_27"
    },
    {
      "name": "Wheat fields",
      "type": "field",
      "description": "The fox mentions the wheat fields.",
      "significance": "The fox's connection to the little prince through the color of his hair.",
      "_key": "LOCA_28"
    },
    {
      "name": "Village",
      "type": "village",
      "description": "The well is described as being like a well in a village.",
      "significance": "Used for comparison to describe the well.",
      "_key": "LOCA_29"
    },
    {
      "name": "Sahara",
      "type": "desert",
      "description": "The wells of the Sahara are mentioned.",
      "significance": "Used for comparison to describe the well.",
      "_key": "LOCA_30"
    }
  ],
  "CREATURE": [
    {
      "name": "boa constrictor",
      "description": "A large snake that swallows its prey whole and digests it for six months.",
      "significance": "Used in the narrator's drawings to illustrate his point about grown-ups' lack of understanding.",
      "_key": "CREA_01"
    },
    {
      "name": "elephant",
      "description": "A large, cumbersome animal.",
      "significance": "The boa constrictor is depicted digesting an elephant in the narrator's drawing.",
      "_key": "CREA_02"
    },
    {
      "name": "sheep",
      "description": "A domesticated animal.",
      "significance": "The little prince asks the narrator to draw a sheep, which becomes a central element of the story.",
      "_key": "CREA_03"
    },
    {
      "name": "baobab",
      "description": "A large tree with deep roots.",
      "significance": "The little prince warns about the dangers of baobabs, which can destroy a planet if not dealt with early.",
      "_key": "CREA_04"
    },
    {
      "name": "rose",
      "description": "A flower with thorns.",
      "significance": "The little prince's love for his unique rose is a central theme, representing love, responsibility, and the value of relationships.",
      "_key": "CREA_05"
    },
    {
      "name": "caterpillar",
      "description": "A larval form of a butterfly.",
      "significance": "The rose mentions caterpillars as a part of her life cycle.",
      "_key": "CREA_06"
    },
    {
      "name": "butterfly",
      "description": "An insect that undergoes metamorphosis.",
      "significance": "The rose mentions butterflies as a part of her life cycle.",
      "_key": "CREA_07"
    },
    {
      "name": "sea bird",
      "description": "A bird that lives near the sea.",
      "significance": "The king uses the example of a sea bird to illustrate the importance of reasonable orders.",
      "_key": "CREA_08"
    },
    {
      "name": "old rat",
      "description": "A rodent.",
      "significance": "The king mentions an old rat on his planet that he judges.",
      "_key": "CREA_09"
    },
    {
      "name": "fox",
      "description": "A wild animal.",
      "significance": "The little prince befriends a fox, who teaches him about the importance of taming and establishing ties.",
      "_key": "CREA_10"
    },
    {
      "name": "locomotive engineer",
      "description": "The person who operates a locomotive.",
      "significance": "The switchman says that the locomotive engineer does not know what the travelers are looking for.",
      "_key": "CREA_11"
    },
    {
      "name": "snake",
      "description": "A reptile.",
      "significance": "The little prince encounters a snake in the desert, who offers to help him return to his planet.",
      "_key": "CREA_12"
    }
  ],
  "EVENT": [
    {
      "name": "Announcement",
      "type": "information",
      "summary": "The ebook is designed and produced by Bomoo.com, which collected the content from Internet. You can distribute it free, but any business use and any edit are prohibited.",
      "_key": "EVEN_01"
    },
    {
      "name": "Narrator's Plane Crash",
      "type": "accident",
      "summary": "The narrator crashes his plane in the Sahara Desert.",
      "_key": "EVEN_02"
    },
    {
      "name": "Meeting the Little Prince",
      "type": "meeting",
      "summary": "The narrator meets the little prince in the desert.",
      "_key": "EVEN_03"
    },
    {
      "name": "Drawing the Sheep",
      "type": "interaction",
      "summary": "The little prince asks the narrator to draw a sheep, leading to several attempts and the eventual drawing of a box with a sheep inside.",
      "_key": "EVEN_04"
    },
    {
      "name": "Learning about the Little Prince's Planet",
      "type": "information",
      "summary": "The narrator learns that the little prince comes from a planet scarcely larger than a house.",
      "_key": "EVEN_05"
    },
    {
      "name": "Identifying Asteroid B-612",
      "type": "information",
      "summary": "The narrator speculates that the little prince's planet is Asteroid B-612.",
      "_key": "EVEN_06"
    },
    {
      "name": "Baobab Warning",
      "type": "warning",
      "summary": "The little prince warns about the dangers of baobab trees and the importance of removing them early.",
      "_key": "EVEN_07"
    },
    {
      "name": "Sunsets on the Little Prince's Planet",
      "type": "conversation",
      "summary": "The little prince talks about his love for sunsets and how he can watch them whenever he wants on his small planet.",
      "_key": "EVEN_08"
    },
    {
      "name": "The Secret of the Rose",
      "type": "revelation",
      "summary": "The little prince reveals the secret of his life, which involves a unique rose and the importance of love and responsibility.",
      "_key": "EVEN_09"
    },
    {
      "name": "The Rose's Arrival",
      "type": "backstory",
      "summary": "The narrator learns about the rose that arrived on the little prince's planet and the little prince's relationship with it.",
      "_key": "EVEN_10"
    },
    {
      "name": "The Little Prince's Departure",
      "type": "departure",
      "summary": "The little prince decides to leave his planet, taking advantage of a flock of migrating birds.",
      "_key": "EVEN_11"
    },
    {
      "name": "Visit to the King",
      "type": "journey",
      "summary": "The little prince visits a king who rules over everything, but has no real power.",
      "_key": "EVEN_12"
    },
    {
      "name": "Visit to the Conceited Man",
      "type": "journey",
      "summary": "The little prince visits a conceited man who only cares about admiration.",
      "_key": "EVEN_13"
    },
    {
      "name": "Visit to the Tippler",
      "type": "journey",
      "summary": "The little prince visits a tippler who drinks to forget his shame.",
      "_key": "EVEN_14"
    },
    {
      "name": "Visit to the Businessman",
      "type": "journey",
      "summary": "The little prince visits a businessman who owns and counts stars.",
      "_key": "EVEN_15"
    },
    {
      "name": "Visit to the Lamplighter",
      "type": "journey",
      "summary": "The little prince visits a lamplighter who faithfully lights and extinguishes a lamp every minute.",
      "_key": "EVEN_16"
    },
    {
      "name": "Visit to the Geographer",
      "type": "journey",
      "summary": "The little prince visits a geographer who knows about the world but doesn't explore it.",
      "_key": "EVEN_17"
    },
    {
      "name": "Meeting the Snake",
      "type": "meeting",
      "summary": "The little prince meets a snake in the desert who offers to help him return to his planet.",
      "_key": "EVEN_18"
    },
    {
      "name": "Meeting the Flower",
      "type": "meeting",
      "summary": "The little prince meets a flower in the desert who tells him about the lack of men.",
      "_key": "EVEN_19"
    },
    {
      "name": "Climbing the Mountain",
      "type": "journey",
      "summary": "The little prince climbs a mountain and hears an echo.",
      "_key": "EVEN_20"
    },
    {
      "name": "Discovering the Rose Garden",
      "type": "discovery",
      "summary": "The little prince discovers a garden of roses that look like his own, leading to sadness.",
      "_key": "EVEN_21"
    },
    {
      "name": "Meeting the Fox",
      "type": "meeting",
      "summary": "The little prince befriends a fox who teaches him about the importance of taming and establishing ties.",
      "_key": "EVEN_22"
    },
    {
      "name": "Meeting the Railway Switchman",
      "type": "meeting",
      "summary": "The little prince encounters a railway switchman who sorts travelers.",
      "_key": "EVEN_23"
    },
    {
      "name": "Meeting the Merchant",
      "type": "meeting",
      "summary": "The little prince meets a merchant who sells pills to quench thirst.",
      "_key": "EVEN_24"
    },
    {
      "name": "Searching for Water",
      "type": "journey",
      "summary": "The narrator and the little prince search for water in the desert.",
      "_key": "EVEN_25"
    },
    {
      "name": "Finding the Well",
      "type": "discovery",
      "summary": "The narrator and the little prince find a well in the desert.",
      "_key": "EVEN_26"
    },
    {
      "name": "Discussing the Muzzle",
      "type": "conversation",
      "summary": "The little prince asks the narrator to draw a muzzle for his sheep.",
      "_key": "EVEN_27"
    },
    {
      "name": "The Little Prince's Return",
      "type": "departure",
      "summary": "The little prince prepares to return to his planet, explaining that he will appear to die but will actually be returning to his star.",
      "_key": "EVEN_28"
    },
    {
      "name": "The Little Prince's Disappearance",
      "type": "departure",
      "summary": "The little prince allows the snake to bite him, seemingly dying, and the narrator is left to wonder about his fate.",
      "_key": "EVEN_29"
    },
    {
      "name": "Afterthoughts",
      "type": "reflection",
      "summary": "The narrator reflects on the little prince's disappearance and the mystery of whether the sheep ate the rose.",
      "_key": "EVEN_30"
    }
  ]
}